app/views/samples/show.html.erb

SELECT "producers".* FROM "producers" INNER JOIN "producers_samples" ON "producers"."id" = "producers_samples"."producer_id" WHERE "producers_samples"."sample_id" = ?  [["sample_id", 16]]
---
<b><%= t('.producer') %></b>
<% @sample.producers.each do |producer| %>