app/views/ogsongs/show.html.erb

SELECT "producers".* FROM "producers" INNER JOIN "ogsongs_producers" ON "producers"."id" = "ogsongs_producers"."producer_id" WHERE "ogsongs_producers"."ogsong_id" = ?  [["ogsong_id", 2]]
---
<b><%= t('.producer') %></b>
<% @ogsong.producers.each do |producer| %>

SELECT "samples".* FROM "samples" WHERE "samples"."ogsong_id" = ?  [["ogsong_id", 2]]
---
      <%# Prints each song that has sampled from the original song %>
    <% @ogsong.samples.each do |sample| %>