app/views/producers/show.html.erb

        <%# Prints all original songs producer has worked on %>
    <% @producer.ogsongs.each do |ogsong| %>
---
SELECT "ogsongs".* FROM "ogsongs" INNER JOIN "ogsongs_producers" ON "ogsongs"."id" = "ogsongs_producers"."ogsong_id" WHERE "ogsongs_producers"."producer_id" = ?  [["producer_id", 1]]