app/controllers/ogsongs_controller.rb

  def index
    @ogsongs = Ogsong.all
---
SELECT "ogsongs".* FROM "ogsongs"

  def create
    @ogsong = Ogsong.new(ogsong_params)

    respond_to do |format|
      #if ogsong created successfully, show notice
      if @ogsong.save
---
INSERT INTO "ogsongs" ("title", "artist", "lyrics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "VCR"], ["artist", "The xx"], ["lyrics", ""], ["created_at", "2019-12-01 01:04:05.958081"], ["updated_at", "2019-12-01 01:04:05.958081"]]

  def destroy
    @ogsong.destroy
---
DELETE FROM "ogsongs" WHERE "ogsongs"."id" = ?  [["id", 10]]

    def set_ogsong
      @ogsong = Ogsong.find(params[:id])
---
SELECT  "ogsongs".* FROM "ogsongs" WHERE "ogsongs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]