app/controllers/producers_controller.rb

SELECT "producers".* FROM "producers"
---
  def index
    @producers = Producer.all

INSERT INTO "producers" ("name", "email", "telephone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rick Rubin"], ["email", "rickrubin@email.com"], ["telephone", "68465123"], ["created_at", "2019-12-14 02:49:42.351407"], ["updated_at", "2019-12-14 02:49:42.351407"]]
---
  def create
    @producer = Producer.new(producer_params)

    respond_to do |format|
  #if producer created successfully, show notice
      if @producer.save

DELETE FROM "producers" WHERE "producers"."id" = ?  [["id", 5]]
---
  def destroy
    @producer.destroy

SELECT  "producers".* FROM "producers" WHERE "producers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_producer
      @producer = Producer.find(params[:id])