app/controllers/samples_controller.rb

SELECT "samples".* FROM "samples"
---
  def index
    @samples = Sample.all

INSERT INTO "samples" ("ogsong_id", "title", "artist", "lyrics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["ogsong_id", 2], ["title", "Poundcake"], ["artist", "Drake"], ["lyrics", ""], ["created_at", "2019-12-11 18:37:13.323784"], ["updated_at", "2019-12-11 18:37:13.323784"]]
---
  def create
    @sample = @ogsong.samples.new(sample_params)

    respond_to do |format|
        #if sample created successfully, show notice
      if @sample.save

UPDATE "samples" SET "title" = ?, "artist" = ?, "updated_at" = ? WHERE "samples"."id" = ?  [["title", "Poundcake"], ["artist", "Drake"], ["updated_at", "2019-12-01 02:13:29.972865"], ["id", 1]]
---
  def update
    respond_to do |format|
        #if producer updated successfully, show notice
      if @sample.update(sample_params)

DELETE FROM "samples" WHERE "samples"."id" = ?  [["id", 1]]
---
  def destroy
    @sample.destroy

SELECT  "ogsongs".* FROM "ogsongs" WHERE "ogsongs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_ogsong
      @ogsong = Ogsong.find_by(id: params[:ogsong_id]) || Ogsong.find(sample_params[:ogsong_id])

SELECT  "samples".* FROM "samples" WHERE "samples"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def set_sample
      @sample = Sample.find(params[:id])